;此脚本目前支持两种状态切换

;防止重复打开脚本
#SingleInstance ignore

;设置托盘图标，bear.ico就是你可以替换自己的图标
Menu,tray,icon,bear.ico,,1
;设置托盘提示,软件名字显示
Menu,tray,Tip,小熊注音V1.0

TrayTip

state:=1

;按CapLock键切换，可以自己改喜欢的键ㄋ
CapsLock::
	state:=state*-1
return

;最重要就是这句了#if了，满足条件就激活热键，实现了模式切换，具体可以看帮助文档
#if state=1
;下面是热键区，自己可以看着加和修改------------------------------自定义区
1::ㄅ
q::ㄆ
a::ㄇ
z::ㄈ
2::ㄉ
w::ㄊ
s::ㄋ
x::ㄌ
e::ㄍ
d::ㄎ
c::ㄏ
r::ㄐ
f::ㄑ
v::ㄒ
5::ㄓ
t::ㄔ
g::ㄕ
b::ㄖ
y::ㄗ
h::ㄘ
n::ㄙ
u::ㄧ
j::ㄨ
m::ㄩ
8::ㄚ
i::ㄛ
k::ㄜ
,::ㄝ
9::ㄞ
o::ㄟ
l::ㄠ
.::ㄡ
0::ㄢ
p::ㄣ
`;::ㄤ
/::ㄥ
-::ㄦ